---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.PathOfTravel
source: html/d598a0f9-249c-ee48-f8ab-157f7c5a9f5a.htm
---
# PathOfTravel Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.